Revit 2026 API
Rebar.CreateFreeForm Method
Overload List
Name | Description
CreateFreeForm(Document, Guid, RebarBarType, Element) |  Creates a free form rebar that can have constraints.
CreateFreeForm(Document, RebarBarType, Element, IList<CurveLoop>, RebarFreeFormValidationResult) | Obsolete.
CreateFreeForm(Document, RebarBarType, Element, IList<CurveLoop>, RebarStyle)
CreateFreeForm(Document, RebarBarType, Element, IList<IList<Curve>>, RebarFreeFormValidationResult) | Obsolete.
CreateFreeForm(Document, RebarBarType, Element, IList<IList<Curve>>, RebarStyle)
Top
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace